{
    "common": {
        "name": "hm-rega",
        "version": "3.0.20",
        "news": {
            "3.0.20": {
                "en": "admin/controller has a bug still requiring `common.title` (fixes #133)",
                "de": "admin / controller hat einen Fehler, der immer noch \"common.title\" erfordert (Fixes # 133)",
                "ru": "У администратора / контроллера есть ошибка, по-прежнему требующая `common.title` (исправления # 133)",
                "pt": "admin / controlador tem um bug que ainda requer `common.title` (correções # 133)",
                "nl": "admin / controller heeft een bug die nog steeds `common.title` vereist (fixes # 133)",
                "fr": "admin / controller a un bogue nécessitant toujours `common.title` (corrections # 133)",
                "it": "admin / controller ha un bug che richiede ancora `common.title` (correzioni # 133)",
                "es": "admin / controller tiene un error que aún requiere `common.title` (arreglos # 133)",
                "pl": "administrator / kontroler ma błąd wciąż wymagający `common.title` (poprawki # 133)",
                "zh-cn": "管理员/控制器有一个仍然需要`common.title`的错误（修正＃133）"
            },
            "3.0.19": {
                "en": "fix for custom webinterface port (addresses #117)",
                "de": "Fix für benutzerdefinierten Webinterface-Port (Adressen # 117)",
                "ru": "исправление для настраиваемого порта веб-интерфейса (адреса # 117)",
                "pt": "correção para porta de interface da web personalizada (endereços # 117)",
                "nl": "reparatie voor aangepaste webinterfacepoort (adressen # 117)",
                "fr": "correction pour le port d'interface Web personnalisé (adresses # 117)",
                "it": "correzione per la porta dell'interfaccia web personalizzata (indirizzi # 117)",
                "es": "corrección para puerto de interfaz web personalizado (direcciones # 117)",
                "pl": "poprawka dla niestandardowego portu interfejsu internetowego (adresy # 117)",
                "zh-cn": "修复自定义Web界面端口（地址＃117）"
            },
            "3.0.18": {
                "en": "local link now respects port and protocol",
                "de": "Die lokale Verbindung respektiert jetzt Port und Protokoll",
                "ru": "локальная ссылка теперь уважает порт и протокол",
                "pt": "o link local agora respeita a porta e o protocolo",
                "nl": "lokale link respecteert nu poort en protocol",
                "fr": "le lien local respecte désormais le port et le protocole",
                "it": "il collegamento locale ora rispetta la porta e il protocollo",
                "es": "el enlace local ahora respeta el puerto y el protocolo",
                "pl": "łącze lokalne obsługuje teraz port i protokół",
                "zh-cn": "本地链接现在遵守端口和协议"
            },
            "3.0.17": {
                "en": "correctly identify incomplete requests",
                "de": "unvollständige Anfragen korrekt identifizieren",
                "ru": "правильно определять неполные запросы",
                "pt": "identificar corretamente os pedidos incompletos",
                "nl": "onvolledige verzoeken correct identificeren",
                "fr": "identifier correctement les demandes incomplètes",
                "it": "identificare correttamente le richieste incomplete",
                "es": "identificar correctamente las solicitudes incompletas",
                "pl": "poprawnie zidentyfikować niekompletne wnioski",
                "zh-cn": "正确识别不完整的请求"
            },
            "3.0.16": {
                "en": "fix issue with non-existing objects when using LAN-Gateways",
                "de": "Behebung eines Problems mit nicht vorhandenen Objekten bei Verwendung von LAN-Gateways",
                "ru": "исправить проблему с несуществующими объектами при использовании LAN-шлюзов",
                "pt": "corrigir o problema com objetos não existentes ao usar LAN-Gateways",
                "nl": "probleem oplossen met niet-bestaande objecten bij gebruik van LAN-gateways",
                "fr": "correction d'un problème avec des objets non existants lors de l'utilisation de passerelles LAN",
                "it": "risolvere il problema con oggetti inesistenti quando si utilizzano gateway LAN",
                "es": "solucionar el problema con los objetos no existentes al usar LAN-Gateways",
                "pl": "naprawiono problem z nieistniejącymi obiektami podczas korzystania z bram sieci LAN",
                "zh-cn": "修复使用LAN-Gateways时不存在的对象的问题"
            },
            "3.0.15": {
                "en": "Ensure that objects are created if something (devices, variables, programs) created during runtime (fixes #124)",
                "de": "Stellen Sie sicher, dass Objekte erstellt werden, wenn zur Laufzeit etwas (Geräte, Variablen, Programme) erstellt wurde (Fixes # 124).",
                "ru": "Убедитесь, что объекты созданы, если что-то (устройства, переменные, программы) было создано во время выполнения (исправления # 124)",
                "pt": "Certifique-se de que os objetos sejam criados se algo (dispositivos, variáveis, programas) for criado durante o tempo de execução (correções # 124)",
                "nl": "Zorg ervoor dat objecten worden gemaakt als er iets (apparaten, variabelen, programma's) is gemaakt tijdens runtime (fixes # 124)",
                "fr": "Assurez-vous que les objets sont créés si quelque chose (périphériques, variables, programmes) est créé pendant l'exécution (corrections # 124)",
                "it": "Assicurati che gli oggetti vengano creati se qualcosa (dispositivi, variabili, programmi) viene creato durante il runtime (correzioni # 124)",
                "es": "Asegúrese de que los objetos se creen si algo (dispositivos, variables, programas) se crea durante el tiempo de ejecución (arreglos # 124)",
                "pl": "Upewnij się, że obiekty są tworzone, jeśli coś (urządzenia, zmienne, programy) zostały utworzone w czasie wykonywania (poprawki # 124)",
                "zh-cn": "确保在运行时创建某些对象（设备，变量，程序）时创建对象（修复程序＃124）"
            },
            "3.0.14": {
                "en": "fix pot. crash after reconnect because of existingStates array",
                "de": "Topf reparieren. Absturz nach erneuter Verbindung aufgrund des vorhandenen State-Arrays",
                "ru": "исправить горшок. сбой после повторного подключения из-за массива существующих состояний",
                "pt": "consertar maconha. travar após reconectar por causa da matriz existingStates",
                "nl": "maak de pot vast. crasht na opnieuw verbinden vanwege een bestaande matrix",
                "fr": "réparer le pot. crash après reconnexion à cause du tableau existingStates",
                "it": "piatto fisso. arresto anomalo dopo la riconnessione a causa dell'array existingStates",
                "es": "arreglar la olla. falla después de reconectar debido a una matriz de estado existente",
                "pl": "naprawić garnek. Awaria po ponownym połączeniu z powodu tablicy existingStates",
                "zh-cn": "修理锅。由于existingStates数组而重新连接后崩溃"
            },
            "3.0.13": {
                "en": "ensure to not set states of non-existing RPC objects due to differences in the APIs (fixes #123)",
                "de": "Stellen Sie sicher, dass keine Zustände nicht vorhandener RPC-Objekte aufgrund von Unterschieden in den APIs festgelegt werden (Fixes # 123).",
                "ru": "убедитесь, что не устанавливаются состояния несуществующих объектов RPC из-за различий в API (исправления # 123)",
                "pt": "certifique-se de não definir estados de objetos RPC não existentes devido a diferenças nas APIs (correções # 123)",
                "nl": "zorg ervoor dat u geen statussen instelt van niet-bestaande RPC-objecten vanwege verschillen in de API's (fixes # 123)",
                "fr": "assurez-vous de ne pas définir les états des objets RPC non existants en raison de différences dans les API (correctifs # 123)",
                "it": "assicurarsi di non impostare stati di oggetti RPC non esistenti a causa delle differenze nelle API (correzioni # 123)",
                "es": "asegúrese de no establecer estados de objetos RPC no existentes debido a diferencias en las API (arreglos # 123)",
                "pl": "zapewnić, aby nie ustawiać stanów nieistniejących obiektów RPC ze względu na różnice w interfejsach API (poprawki nr 123)",
                "zh-cn": "确保不设置由于API的不同而导致的不存在的RPC对象的状态（修复＃123）"
            },
            "3.0.12": {
                "en": "we now handle some more edge case errors",
                "de": "Wir behandeln jetzt einige weitere Randfallfehler",
                "ru": "Теперь мы обрабатываем еще несколько ошибок крайнего случая",
                "pt": "agora lidamos com mais alguns erros de caso extremo",
                "nl": "we behandelen nu wat meer edge case-fouten",
                "fr": "nous traitons maintenant d'autres erreurs de cas de bord",
                "it": "ora gestiamo altri errori di casi limite",
                "es": "ahora manejamos algunos errores más de casos extremos",
                "pl": "teraz zajmiemy się więcej błędami w przypadku skrajnych przypadków",
                "zh-cn": "我们现在处理更多边缘情况错误"
            },
            "3.0.11": {
                "en": "we now handle some more edge case errors",
                "de": "Wir behandeln jetzt einige weitere Randfallfehler",
                "ru": "Теперь мы обрабатываем еще несколько ошибок крайнего случая",
                "pt": "agora lidamos com mais alguns erros de caso extremo",
                "nl": "we behandelen nu wat meer edge case-fouten",
                "fr": "nous traitons maintenant d'autres erreurs de cas de bord",
                "it": "ora gestiamo altri errori di casi limite",
                "es": "ahora manejamos algunos errores más de casos extremos",
                "pl": "teraz zajmiemy się więcej błędami w przypadku skrajnych przypadków",
                "zh-cn": "我们现在处理更多边缘情况错误"
            },
            "3.0.10": {
                "en": "no build needed",
                "de": "Kein Build erforderlich",
                "ru": "сборка не требуется",
                "pt": "nenhuma construção necessária",
                "nl": "geen build nodig",
                "fr": "aucune construction nécessaire",
                "it": "nessuna build necessaria",
                "es": "no se necesita construcción",
                "pl": "nie potrzeba kompilacji",
                "zh-cn": "无需构建"
            },
            "3.0.9": {
                "en": "fix gh actions",
                "de": "Beheben Sie Gh-Aktionen",
                "ru": "исправить действия gh",
                "pt": "corrigir ações gh",
                "nl": "gh-acties repareren",
                "fr": "corriger les actions gh",
                "it": "correggere azioni gh",
                "es": "arreglar acciones de gh",
                "pl": "napraw działania gh",
                "zh-cn": "修复gh动作"
            },
            "3.0.8": {
                "en": "we now wait until objects are created before setting states (fixes #122)\nadded release script",
                "de": "Wir warten nun, bis Objekte erstellt wurden, bevor wir Zustände festlegen (Fixes # 122).\nRelease-Skript hinzugefügt",
                "ru": "теперь мы ждем, пока объекты не будут созданы, прежде чем устанавливать состояния (исправления # 122)\nдобавлен скрипт выпуска",
                "pt": "agora esperamos até que os objetos sejam criados antes de definir os estados (correções # 122)\nadicionado script de lançamento",
                "nl": "we wachten nu totdat objecten zijn gemaakt voordat we toestanden instellen (fixes # 122)\ntoegevoegd release script",
                "fr": "nous attendons maintenant que les objets soient créés avant de définir les états (corrections # 122)\nscript de version ajouté",
                "it": "ora aspettiamo che gli oggetti vengano creati prima di impostare gli stati (correzione # 122)\naggiunto script di rilascio",
                "es": "ahora esperamos hasta que se creen los objetos antes de establecer estados (arreglos # 122)\nscript de lanzamiento agregado",
                "pl": "teraz czekamy, aż obiekty zostaną utworzone przed ustawieniem stanów (poprawki # 122)\ndodany skrypt wydania",
                "zh-cn": "现在，我们等待创建对象之前设置状态（修复＃122）\n添加了发布脚本"
            },
            "3.0.7": {
                "en": "we notify the user about aborted connection by CCU during request",
                "de": "Wir benachrichtigen den Benutzer während der Anfrage über einen Verbindungsabbruch durch die CCU",
                "ru": "мы уведомляем пользователя о разрыве соединения CCU во время запроса",
                "pt": "notificamos o usuário sobre a conexão abortada pelo CCU durante a solicitação",
                "nl": "we informeren de gebruiker over een afgebroken verbinding door CCU tijdens het verzoek",
                "fr": "nous informons l'utilisateur de l'interruption de la connexion par CCU lors de la demande",
                "it": "informiamo l'utente della connessione interrotta dalla CCU durante la richiesta",
                "es": "notificamos al usuario sobre la conexión abortada por CCU durante la solicitud",
                "pl": "powiadamiamy użytkownika o przerwaniu połączenia przez CCU podczas żądania",
                "zh-cn": "我们在请求期间通知用户有关CCU中止连接的信息"
            },
            "3.0.6": {
                "en": "we don't write datapoints if timestamp is 0",
                "de": "Wir schreiben keine Datenpunkte, wenn der Zeitstempel 0 ist",
                "ru": "мы не записываем точки данных, если отметка времени равна 0",
                "pt": "não gravamos pontos de dados se o carimbo de data / hora for 0",
                "nl": "we schrijven geen datapunten als het tijdstempel 0 is",
                "fr": "nous n'écrivons pas de points de données si l'horodatage est 0",
                "it": "non scriviamo datapoint se timestamp è 0",
                "es": "no escribimos puntos de datos si la marca de tiempo es 0",
                "pl": "nie zapisujemy punktów danych, jeśli znacznik czasu wynosi 0",
                "zh-cn": "如果时间戳为0，我们不写数据点"
            },
            "3.0.5": {
                "en": "we now provide possibility to use custom webinterface port, please see FAQ",
                "de": "Wir bieten jetzt die Möglichkeit, einen benutzerdefinierten Webinterface-Port zu verwenden (siehe FAQ)",
                "ru": "теперь мы предоставляем возможность использовать собственный порт веб-интерфейса, см. FAQ",
                "pt": "agora oferecemos a possibilidade de usar uma porta de interface da web personalizada, consulte o FAQ",
                "nl": "we bieden nu de mogelijkheid om een aangepaste webinterfacepoort te gebruiken, zie FAQ",
                "fr": "nous offrons maintenant la possibilité d'utiliser un port d'interface Web personnalisé, veuillez consulter la FAQ",
                "it": "ora forniamo la possibilità di utilizzare la porta dell'interfaccia web personalizzata, vedere le domande frequenti",
                "es": "ahora ofrecemos la posibilidad de utilizar un puerto de interfaz web personalizado, consulte las preguntas frecuentes",
                "pl": "oferujemy teraz możliwość korzystania z niestandardowego portu interfejsu internetowego, zobacz FAQ",
                "zh-cn": "我们现在提供使用自定义Web界面端口的可能性，请参阅常见问题解答"
            },
            "3.0.4": {
                "en": "fixed missing enum translations (changed in API)",
                "de": "fehlende Enum-Übersetzungen behoben (in API geändert)",
                "ru": "исправлены отсутствующие переводы enum (изменено в API)",
                "pt": "corrigidas traduções enum ausentes (alteradas na API)",
                "nl": "ontbrekende enum-vertalingen opgelost (gewijzigd in API)",
                "fr": "corrections d'énumérations manquantes (modifiées dans l'API)",
                "it": "risolte traduzioni enum mancanti (modificate nell'API)",
                "es": "Se corrigieron las traducciones de enumeración que faltaban (cambiadas en la API)",
                "pl": "naprawiono brakujące tłumaczenia wyliczeń (zmienione w API)",
                "zh-cn": "修复缺少的枚举翻译（已在API中更改）"
            },
            "2.6.25": {
                "en": "fixed aliases being removed from enums if they contain \"hm-rpc.\"",
                "de": "Fehler behoben, bei denen Aliase aus Aufzählungen entfernt wurden, wenn sie \"hm-rpc\" enthielten.",
                "ru": "исправлено удаление псевдонимов из перечислений, если они содержат «hm-rpc».",
                "pt": "aliases corrigidos sendo removidos de enums se contiverem \"hm-rpc.\"",
                "nl": "vaste aliassen verwijderd uit enums als ze \"hm-rpc\" bevatten.",
                "fr": "correction des alias supprimés des énumérations s'ils contiennent \"hm-rpc\".",
                "it": "corretti gli alias rimossi dalle enumerazioni se contengono \"hm-rpc\".",
                "es": "Se corrigieron los alias que se eliminaron de las enumeraciones si contienen \"hm-rpc\".",
                "pl": "naprawiono usuwanie aliasów z wyliczeń, jeśli zawierają one „hm-rpc”.",
                "zh-cn": "固定别名（如果它们包含“ hm-rpc”）将从枚举中删除。"
            },
            "2.6.24": {
                "en": "now states will be accordingly marked to indicate that rega is down when receiving invalid responses",
                "de": "Jetzt werden Zustände entsprechend markiert, um anzuzeigen, dass die Rega beim Empfang ungültiger Antworten nicht verfügbar ist",
                "ru": "Теперь состояния будут соответственно отмечены, чтобы указать, что rega не работает при получении неверных ответов",
                "pt": "agora os estados serão devidamente marcados para indicar que rega está inativo ao receber respostas inválidas",
                "nl": "Nu worden staten dienovereenkomstig gemarkeerd om aan te geven dat rega down is bij het ontvangen van ongeldige antwoorden",
                "fr": "maintenant les états seront marqués en conséquence pour indiquer que rega est en panne lors de la réception de réponses invalides",
                "it": "ora gli stati saranno contrassegnati di conseguenza per indicare che la rega è inattiva quando si ricevono risposte non valide",
                "es": "ahora los estados se marcarán en consecuencia para indicar que rega está inactivo cuando se reciben respuestas no válidas",
                "pl": "teraz stany będą odpowiednio oznaczone, aby wskazać, że rega nie działa podczas otrzymywania nieprawidłowych odpowiedzi",
                "zh-cn": "现在状态将相应地标记为指示接收到无效响应时rega已关闭"
            },
            "2.6.23": {
                "en": "fixes for edge case crashes",
                "de": "Korrekturen für Edge-Case-Abstürze",
                "ru": "исправления сбоев крайнего случая",
                "pt": "correções para falhas de casos extremos",
                "nl": "oplossingen voor crashes aan de rand",
                "fr": "correctifs pour les plantages de bordures",
                "it": "correzioni per crash del case edge",
                "es": "arreglos para fallas de casos de borde",
                "pl": "poprawki dotyczące awarii skrajnych",
                "zh-cn": "修复了边缘机壳崩溃的问题"
            }
        },
        "title": "HomeMatic ReGaHSS",
        "titleLang": {
            "en": "HomeMatic ReGaHSS",
            "de": "HomeMatic ReGaHSS"
        },
        "desc": {
            "en": "Connects HomeMatic CCU \"Logic Layer\" (\"ReGaHSS\") to ioBroker",
            "de": "Verbindet die Logikschicht einer HomeMatic CCU (\"ReGaHSS\") mit ioBroker",
            "ru": "Соединяет модуль логики системы Homematic CCU (\"ReGaHSS\") с ioBroker",
            "pt": "Conecta o HomeMatic CCU \"Layer Lógica\" (\"ReGaHSS\") para ioBroker",
            "nl": "Verbindt HomeMatic CCU \"Logic Layer\" (\"ReGaHSS \") met ioBroker",
            "fr": "Connecte HomeMatic CCU \"Logic Layer\" (\"ReGaHSS\") à ioBroker",
            "it": "Collega HomeMatic CCU \"Logic Layer\" (\"ReGaHSS\") a ioBroker",
            "es": "Conecta CCU HomeMatic \"Capa lógica\" (\"ReGaHSS\") a ioBroker",
            "pl": "Łączy HomeMatic CCU \"Logic Layer\" (\"ReGaHSS\") z ioBroker"
        },
        "dependencies": [
            "hm-rpc",
            {
                "js-controller": ">=2.0.0"
            }
        ],
        "authors": [
            "hobbyquaker <hq@ccu.io>",
            "bluefox <dogafox@gmail.com>",
            "Moritz Heusinger <moritz.heusinger@gmail.com>"
        ],
        "license": "MIT",
        "mode": "daemon",
        "platform": "Javascript/Node.js",
        "loglevel": "info",
        "materialize": true,
        "docs": {
            "en": "README.md"
        },
        "icon": "homematic.png",
        "compact": true,
        "messagebox": true,
        "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.hm-rega/master/admin/homematic.png",
        "keywords": [
            "homematic",
            "eq3",
            "regahss",
            "ccu1",
            "ccu2"
        ],
        "localLinks": {
            "_default": "%webinterfaceProtocol%://%homematicAddress%:%webinterfacePort%"
        },
        "type": "iot-systems",
        "connectionType": "local",
        "dataSource": "poll",
        "plugins": {
            "sentry": {
                "dsn": "https://08c0b6d9b71c43cc91e9705877681085@sentry.iobroker.net/11",
                "pathWhitelist": [],
                "errorBlacklist": [
                    "SyntaxError"
                ]
            }
        }
    },
    "native": {
        "homematicAddress": "192.168.0.100",
        "homematicPort": 8181,
        "reconnectionInterval": 30,
        "polling": true,
        "pollingInterval": 30,
        "pollingTrigger": "BidCoS-RF.50.PRESS_SHORT",
        "rfdEnabled": true,
        "rfdAdapter": "hm-rpc.0",
        "hs485denabled": false,
        "hs485dAdapter": "hm-rpc.1",
        "cuxdEnabled": false,
        "cuxdAdapter": "hm-rpc.2",
        "hmipEnabled": false,
        "hmipAdapter": "hm-rpc.3",
        "virtualDevicesEnabled": false,
        "virtualDevicesAdapter": "hm-rpc.4",
        "syncVariables": true,
        "syncPrograms": true,
        "syncNames": true,
        "syncRooms": true,
        "enumRooms": "enum.rooms",
        "syncFunctions": true,
        "enumFunctions": "enum.functions",
        "syncFavorites": true,
        "enumFavorites": "enum.favorites",
        "username": "",
        "password": "",
        "useHttps": false,
        "showInvSysVar": false,
        "webinterfacePort": 80,
        "webinterfaceProtocol": "http"
    },
    "protectedNative": [
        "username",
        "password"
    ],
    "objects": [
        {
            "_id": "_design/hm-rega",
            "language": "javascript",
            "views": {
                "variables": {
                    "map": "function(doc) {\n  if (doc._id.match(/^hm-rega\\.[0-9]+\\.[0-9,A-Z,a-z]+/) && (doc.native.TypeName === 'ALARMDP' || doc.native.TypeName === 'VARDP')) {\n   emit(doc._id, doc);\n  }\n}"
                },
                "programs": {
                    "map": "function(doc) {\n  if (doc._id.match(/^hm-rega\\.[0-9]+\\.[0-9,A-Z,a-z]+/) && (doc.native.TypeName === 'PROGRAM')) {\n   emit(doc._id, doc);\n  }\n}"
                }
            }
        }
    ],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to CCU",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.ccuReachable",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to CCU on IP layer",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.ccuRegaUp",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If rega is UP",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}